In [30]:
student_data = pd.DataFrame({'EmployeeID':[101,102,103,104,105],'Name':['Alice','Bob','Charlie','David','Eva'],'Department':['HR','TT','Finance','IT','HR'],'Salary':[50000,60000,55000,65000,58000]})

In [24]:
import pandas as pd

In [21]:
student_data

   EmployeeID     Name Department  Salary
0         101    Alice         HR   50000
1         102      Bob         TT   60000
2         103  Charlie    Finance   55000
3         104    David         IT   65000
4         105      Eva         HR   58000

In [23]:
student_data[['EmployeeID','Salary']]

   EmployeeID  Salary
0         101   50000
1         102   60000
2         103   55000
3         104   65000
4         105   58000

In [25]:
student_data.rename(columns={'EmployeeID':'ID'},inplace=True)

In [58]:
student_data.loc[1,'Department']='IT'

In [60]:
student_data[student_data['Department']=='IT']['Salary'].mean()

np.float64(62500.0)

In [62]:
student_data[student_data['Department']=='IT']

   EmployeeID   Name Department  Salary   Bonus
1         102    Bob         IT   60000  6000.0
3         104  David         IT   65000  6500.0

In [64]:
student_data['Bonus'] = student_data['Salary']*0.10

In [67]:
student_data

   EmployeeID     Name Department  Salary   Bonus
0         101    Alice         HR   50000  5000.0
1         102      Bob         IT   60000  6000.0
2         103  Charlie    Finance   55000  5500.0
3         104    David         IT   65000  6500.0
4         105      Eva         HR   58000  5800.0

In [76]:
student_data[['Name','Salary']]

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   55000
3    David   65000
4      Eva   58000

In [80]:
student_data.drop(columns=['Department'],inplace = True)

In [82]:
student_data

   EmployeeID     Name  Salary   Bonus
0         101    Alice   50000  5000.0
1         102      Bob   60000  6000.0
2         103  Charlie   55000  5500.0
3         104    David   65000  6500.0
4         105      Eva   58000  5800.0